sum-types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Exhaustive Sum Types in Java with a Visitor</title>
<!-- 2015-03-22 Sun 00:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Josh" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
</head>
<body>
<div id="content">
<h1 class="title">Exhaustive Sum Types in Java with a Visitor</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">What?</a></li>
<li><a href="#unnumbered-2">A Sum type.</a></li>
<li><a href="#unnumbered-3">Using a Visitor.  Also, please don't really do this.</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">What?</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Simply stated, I have heard it said that java could not provide
exhaustive coverage of sum types because it lacks pattern matching.
I will not try and claim that it is as pleasant as a language that
does, however, I also get somewhat annoyed by the idea that this can
not be dealt with
</p>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">A Sum type.</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
I'm not going to provide too much in the way of explanation on what
sum types are.  In large part because I would probably make a
mistake in explaining this.
</p>

<p>
However, by now, I am sure everyone has seen an example of the
Optional type that everyone knows and loves.  Right?
</p>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Using a Visitor.  Also, please don't really do this.</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
If we are willing to go through some extra hurdles in providing a
visitor next to our Option type, we can provide a way where you can
exhaustively list the possible sum types in static code and get the
compiler to help.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Option</span>&lt;<span style="color: #7CB8BB;">A</span>&gt; {
    <span style="color: #F0DFAF; font-weight: bold;">public</span> &lt;<span style="color: #7CB8BB;">B</span>&gt; <span style="color: #7CB8BB;">B</span> <span style="color: #93E0E3;">MATCH</span>(<span style="color: #7CB8BB;">Visitor</span>&lt;<span style="color: #7CB8BB;">A</span>, <span style="color: #7CB8BB;">B</span>&gt; <span style="color: #DFAF8F;">visitor</span>) {
        <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">this</span>.acceptVisitor(visitor);
    }

    <span style="color: #F0DFAF; font-weight: bold;">abstract</span> &lt;<span style="color: #7CB8BB;">B</span>&gt; <span style="color: #7CB8BB;">B</span> <span style="color: #93E0E3;">acceptVisitor</span>(<span style="color: #7CB8BB;">Visitor</span>&lt;<span style="color: #7CB8BB;">A</span>, <span style="color: #7CB8BB;">B</span>&gt; <span style="color: #DFAF8F;">visitor</span>);

    <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">static</span> &lt;<span style="color: #7CB8BB;">A</span>&gt; <span style="color: #7CB8BB;">Option</span>&lt;<span style="color: #7CB8BB;">A</span>&gt; <span style="color: #93E0E3;">some</span>(<span style="color: #7CB8BB;">A</span> <span style="color: #DFAF8F;">value</span>) {
        <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #7CB8BB;">Some</span>&lt;<span style="color: #7CB8BB;">A</span>&gt;(value);
    }

    <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">static</span> &lt;<span style="color: #7CB8BB;">A</span>&gt; <span style="color: #7CB8BB;">Option</span>&lt;<span style="color: #7CB8BB;">A</span>&gt; <span style="color: #93E0E3;">none</span>() {
        <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #7CB8BB;">None</span>&lt;<span style="color: #7CB8BB;">A</span>&gt;();
    }

    <span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">final</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Some</span>&lt;<span style="color: #7CB8BB;">A</span>&gt; <span style="color: #F0DFAF; font-weight: bold;">extends</span> <span style="color: #7CB8BB;">Option</span>&lt;<span style="color: #7CB8BB;">A</span>&gt; {
        <span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #F0DFAF; font-weight: bold;">final</span> <span style="color: #7CB8BB;">A</span> <span style="color: #DFAF8F;">value</span>;
        <span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #93E0E3;">Some</span>(<span style="color: #7CB8BB;">A</span> <span style="color: #DFAF8F;">value</span>) {
            <span style="color: #F0DFAF; font-weight: bold;">this</span>.value = value;
        }
        &lt;B&gt; B acceptVisitor(Visitor&lt;<span style="color: #7CB8BB;">A</span>, B&gt; visitor) {
            <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #BFEBBF;">visitor</span>.SOME(<span style="color: #F0DFAF; font-weight: bold;">this</span>.value);
        }
    }

    <span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">final</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">None</span>&lt;<span style="color: #7CB8BB;">A</span>&gt; <span style="color: #F0DFAF; font-weight: bold;">extends</span> <span style="color: #7CB8BB;">Option</span>&lt;<span style="color: #7CB8BB;">A</span>&gt; {
        &lt;B&gt; B acceptVisitor(Visitor&lt;<span style="color: #7CB8BB;">A</span>, B&gt; visitor) {
            <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #BFEBBF;">visitor</span>.NONE();
        }
    }

    <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">Visitor</span>&lt;<span style="color: #7CB8BB;">A</span>, <span style="color: #7CB8BB;">B</span>&gt; {
        <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">B</span> <span style="color: #93E0E3;">SOME</span>(<span style="color: #7CB8BB;">A</span> <span style="color: #DFAF8F;">value</span>);
        <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">B</span> <span style="color: #93E0E3;">NONE</span>();
    }
}
</pre>
</div>

<p>
Now, one can write code such as the following, where all places
where you would "match" in Scala or similar languages to make sure
you cover all types of the sum value are covered by the visitor methods.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">class</span> <span style="color: #7CB8BB;">OptionExample</span> {
    <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">main</span>(<span style="color: #7CB8BB;">String</span> <span style="color: #DFAF8F;">args</span>[]) {
        <span style="color: #7CB8BB;">Option</span>&lt;<span style="color: #7CB8BB;">String</span>&gt; <span style="color: #DFAF8F;">example</span>;

        example = Option.some(<span style="color: #CC9393;">"Hello World"</span>);

        <span style="color: #7CB8BB;">Integer</span> <span style="color: #DFAF8F;">result</span> = <span style="color: #BFEBBF;">example</span>.MATCH(<span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #BFEBBF;">Option</span>.<span style="color: #7CB8BB;">Visitor</span>&lt;<span style="color: #7CB8BB;">String</span>, <span style="color: #7CB8BB;">Integer</span>&gt;() {
                <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #7CB8BB;">Integer</span> <span style="color: #93E0E3;">SOME</span>(<span style="color: #7CB8BB;">String</span> <span style="color: #DFAF8F;">value</span>) {
                    <span style="color: #F0DFAF; font-weight: bold;">return</span> value.length();
                }
                <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #7CB8BB;">Integer</span> <span style="color: #93E0E3;">NONE</span>() {
                    <span style="color: #F0DFAF; font-weight: bold;">return</span> 0;
                }
            });

        System.out.println(<span style="color: #CC9393;">"We saw "</span> + result + <span style="color: #CC9393;">" characters."</span>);

        example = Option.none();

        result = <span style="color: #BFEBBF;">example</span>.MATCH(<span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #BFEBBF;">Option</span>.<span style="color: #7CB8BB;">Visitor</span>&lt;<span style="color: #7CB8BB;">String</span>, <span style="color: #7CB8BB;">Integer</span>&gt;() {
                <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #7CB8BB;">Integer</span> <span style="color: #93E0E3;">SOME</span>(<span style="color: #7CB8BB;">String</span> <span style="color: #DFAF8F;">value</span>) {
                    <span style="color: #F0DFAF; font-weight: bold;">return</span> value.length();
                }
                <span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #7CB8BB;">Integer</span> <span style="color: #93E0E3;">NONE</span>() {
                    <span style="color: #F0DFAF; font-weight: bold;">return</span> 0;
                }
            });

        System.out.println(<span style="color: #CC9393;">"We saw "</span> + result + <span style="color: #CC9393;">" characters."</span>);

    }
}
</pre>
</div>

<p>
Now, I will make no claims that this is as pleasant as languages
that offer this as a first class citizen.  Nor will I claim that
this replaces pattern matching, as that is actually much more than
this.
</p>

<p>
However, I do claim that if all you want is exhaustive treatment of
the values in a sum type, than the visitor pattern will serve you
for this.
</p>

<p>
I will not claim that it will serve you well, as dealing with this
code in a debugger is just plain annoying.  That moment when you
realize you stepped over instead of in?  Yeah, I hate that.
</p>

<p>
I will further note that it is odd that I can not declare a private
abstract method in Java.  Something that this example would have
quite clearly supported.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josh</p>
<p class="date">Created: 2015-03-22 Sun 00:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.0.50.2 (<a href="http://orgmode.org">Org</a> mode 8.3beta)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
